Перем Пора; // Дата, когда необходимо сработать
Перем Значение; // Хранящееся значение
Перем ДобавлятьПораВПредставление; // Добавить поле пора в представление значения

Функция Задержка() Экспорт
	Возврат Пора - ТекущаяУниверсальнаяДатаВМиллисекундах();
КонецФункции

Функция Значение() Экспорт
	Возврат Значение;
КонецФункции

Процедура ОбработкаПолученияПредставления(Представление, СтандартнаяОбработка) // BSLLS:UnusedLocalMethod-off
	
	СтандартнаяОбработка = Ложь;
	
	Если ДобавлятьПораВПредставление Тогда

		Представление = СтрШаблон(
			"Отложенный{Пора=%1, Значение=%2}",
			Формат(
				МестноеВремя('00010101' + Пора / 1000, ЧасовойПояс()),
				"ДФ=HH:mm:ss"
			) + ":" + Цел(((Пора / 1000) - Цел(Пора / 1000)) * 1000),
			Значение
		);

	Иначе
		Представление = СтрШаблон("Отложенный{Значение=%1}", Значение);
	КонецЕсли;

КонецПроцедуры

Процедура ПриСозданииОбъекта(пПора, пЗначение, пДобавлятьПораВПредставление = Истина)
	Пора = пПора;
	Значение = пЗначение;
	ДобавлятьПораВПредставление = пДобавлятьПораВПредставление;
КонецПроцедуры
