Перем ДляКаждогоВыполнилсяРаз Экспорт;
Перем СуммаЭлементов Экспорт;

Перем ОбъектЗаглушка;

Функция ОбъектЗаглушка() Экспорт

	Если ОбъектЗаглушка <> Неопределено Тогда
		Возврат ОбъектЗаглушка;
	КонецЕсли;

	МетодОбработкаПолученияПредставления = Новый Метод("ОбработкаПолученияПредставления")
		.Параметр(Новый ПараметрМетода("Представление"))
		.Параметр(Новый ПараметрМетода("СтандартнаяОбработка"))
		.ТелоМетода("СтандартнаяОбработка = Ложь; Представление = ""Заглушка""");

	ОбъектЗаглушка = Новый ПостроительДекоратора()
		.Метод(МетодОбработкаПолученияПредставления)
		.Построить();

	Возврат ОбъектЗаглушка;

КонецФункции

Функция ВСтроку(Параметр) Экспорт
	Возврат Строка(Параметр);
КонецФункции

ДляКаждогоВыполнилсяРаз = 0;
СуммаЭлементов = 0;