#Использовать ".."

&Тест
Процедура ИзЭлементов() Экспорт
	
	// Когда

	Результат = Карта.ИзЭлементов(
		1, 1, 2, 2, 3, 3, 4, 4, 5, 5
	);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("ФиксированнаяКарта")
		.ИмеетДлину(5);

	Для Сч = 1 По 5 Цикл

		Ожидаем.Что(Результат.СодержитКлюч(Сч)).ЭтоИстина();
		Ожидаем.Что(Результат.Получить(Сч).Получить()).Равно(Сч);

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Скопировать() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие;
	КартаСоответствие.Вставить(1, 1);
	КартаСоответствие.Вставить(2, 2);

	// Когда

	Результат = Карта.Скопировать(КартаСоответствие);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("ФиксированнаяКарта")
		.ИмеетДлину(2);

	Ожидаем.Что(Результат.СодержитКлюч(1)).ЭтоИстина();
	Ожидаем.Что(Результат.Получить(1).Получить()).Равно(1);

	Ожидаем.Что(Результат.СодержитКлюч(2)).ЭтоИстина();
	Ожидаем.Что(Результат.Получить(2).Получить()).Равно(2);

КонецПроцедуры

&Тест
Процедура СкопироватьВозвращаетСамуКоллекциюЕслиЭтоФиксированнаяКарта() Экспорт

	// Дано
	
	КопируемаяКарта = Карта.ИзЭлементов(
		1, 1, 2, 2, 3, 3, 4, 4, 5, 5
	);

	// Когда

	Результат = Карта.Скопировать(КопируемаяКарта);

	// Тогда

	Ожидаем.Что(Результат).Равно(КопируемаяКарта);

КонецПроцедуры
