#Использовать ".."

&Тест
Процедура КакСписок() Экспорт
	
	// Дано

	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	// Когда

	Результат = Массивы.КакСписок(Массив);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("СписокМассив")
		.ИмеетДлину(3);

	Ожидаем.Что(Результат.Получить(0)).Равно(1);
	Ожидаем.Что(Результат.Получить(1)).Равно(2);
	Ожидаем.Что(Результат.Получить(2)).Равно(3);

КонецПроцедуры

&Тест
Процедура КакМножество() Экспорт
	
	// Дано

	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	// Когда

	Результат = Массивы.КакМножество(Массив);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("МножествоСоответствие")
		.ИмеетДлину(3);

	Ожидаем.Что(Результат.Содержит(1)).ЭтоИстина();
	Ожидаем.Что(Результат.Содержит(2)).ЭтоИстина();
	Ожидаем.Что(Результат.Содержит(3)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура Скопировать() Экспорт
	
	// Дано

	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	// Когда

	Результат = Массивы.Скопировать(Массив);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("Массив")
		.ИмеетДлину(3)
		.Содержит(1)
		.Содержит(2)
		.Содержит(3)
		.Не_().Равно(Массив);

КонецПроцедуры

&Тест
Процедура СкопироватьФиксированный() Экспорт

	// Дано

	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	Массив = Новый ФиксированныйМассив(Массив);

	// Когда

	Результат = Массивы.Скопировать(Массив);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("Массив")
		.ИмеетДлину(3)
		.Содержит(1)
		.Содержит(2)
		.Содержит(3)
		.Не_().Равно(Массив);

КонецПроцедуры

&Тест
Процедура ИзЭлементов() Экспорт

	// Когда

	Результат = Массивы.ИзЭлементов(
		1, 2, 3, 4, 5, 6, 7, 8, 9, 9
	);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("ФиксированныйМассив")
		.ИмеетДлину(10);

	Для Сч = 1 По 9 Цикл
		Ожидаем.Что(Результат[Сч - 1]).Равно(Сч);
	КонецЦикла;

	Ожидаем.Что(Результат[9]).Равно(9);

КонецПроцедуры

&Тест
Процедура Сортировать() Экспорт

	// Дано

	Массив = Новый Массив;

	Массив.Добавить(6);
	Массив.Добавить(2);
	Массив.Добавить(4);
	Массив.Добавить(1);
	Массив.Добавить(3);
	Массив.Добавить(0);
	Массив.Добавить(5);

	// Когда

	Массивы.Сортировать(Массив, СравнениеЗначений.ПрямойПорядок());

	// Тогда

	Ожидаем.Что(Массив[0]).Равно(0);
	Ожидаем.Что(Массив[1]).Равно(1);
	Ожидаем.Что(Массив[2]).Равно(2);
	Ожидаем.Что(Массив[3]).Равно(3);
	Ожидаем.Что(Массив[4]).Равно(4);
	Ожидаем.Что(Массив[5]).Равно(5);
	Ожидаем.Что(Массив[6]).Равно(6);

КонецПроцедуры
