#Использовать ".."

&Тест
Процедура КакСписок(Массив) Экспорт
	
	// Дано

	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	// Когда

	Результат = Массивы.КакСписок(Массив);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("СписокМассив")
		.ИмеетДлину(3);

	Ожидаем.Что(Результат.Получить(0)).Равно(1);
	Ожидаем.Что(Результат.Получить(1)).Равно(2);
	Ожидаем.Что(Результат.Получить(2)).Равно(3);

КонецПроцедуры

&Тест
Процедура КакМножество(Массив) Экспорт
	
	// Дано

	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	// Когда

	Результат = Массивы.КакМножество(Массив);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("МножествоСоответствие")
		.ИмеетДлину(3);

	Ожидаем.Что(Результат.Содержит(1)).ЭтоИстина();
	Ожидаем.Что(Результат.Содержит(2)).ЭтоИстина();
	Ожидаем.Что(Результат.Содержит(3)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура Скопировать(Массив) Экспорт
	
	// Дано

	Массив = Новый Массив;
	Массив.Добавить(1);
	Массив.Добавить(2);
	Массив.Добавить(3);

	// Когда

	Результат = Массивы.Скопировать(Массив);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("Массив")
		.ИмеетДлину(3)
		.Содержит(1)
		.Содержит(2)
		.Содержит(3)
		.Не_().Равно(Массив);

КонецПроцедуры
