#Использовать reflector
#Использовать decorator
// Компилируемся на 1.x
// #Использовать extends

#Использовать ".."

// Тест на самом деле не повторяемый, но так мы его скроем от глаз 1testrunner ввиду того что extends требует 2.0+
&ПовторяемыйТест(1)
Процедура ПроверитьРеализациюИнтерфейсов() Экспорт

	// Загрузим extends
	ПостроительДекоратора = Новый ПостроительДекоратора() // BSLLS:UnusedLocalVariable-off
		.Импорт(Новый Импорт("extends"))
		.Построить();

	ПроцессорыКоллекций.ИзНабора(
			ОбъединитьПути("src", "Классы"),
			ОбъединитьПути("src", "internal", "Классы", "Коллекции"),
			ОбъединитьПути("src", "internal", "Классы", "Итераторы")
		)
		.Развернуть("Путь -> ПроцессорыКоллекций.ИзКоллекции(НайтиФайлы(Путь, ""*.os"", Истина))")
		.ДляКаждого(
			"ФайлКоллекция -> ИнтерфейсыРеализованыКорректно(Тип(ФайлКоллекция.ИмяБезРасширения))",
			Новый ВалидаторРеализации()
		);

КонецПроцедуры
