#Использовать asserts

#Использовать ".."
#Использовать "./ТестМодуль"

Перем ПроверяемоеЧисло; // Переменная в которую пишут фоновые задания

&Тест
Процедура СодержитКлюч() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"СодержитКлюч",
		"2"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).ЭтоИстина();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура СодержитЗначение() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"СодержитЗначение",
		2
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).ЭтоИстина();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ДляКаждого() Экспорт

	ПроверяемоеЧисло = 0;

	// Дано
	
	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ДляКаждого",
		Новый Действие(ЭтотОбъект, "ДобавитьКПроверяемомуЧислу")
	);

	// Тогда

	Ожидаем.Что(ПроверяемоеЧисло).Равно(60);

КонецПроцедуры

&Тест
Процедура Получить() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Получить",
		"1"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат.Получить()).Равно(1);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ПолучитьИлиУмолчание() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ПолучитьИлиУмолчание",
		"4",
		4
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).Равно(4);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Пусто() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Пусто"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).ЭтоЛожь();
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Ключи() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Ключи"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).ИмеетТип("ФиксированноеМножествоКлючей");
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Значения() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Значения"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).ИмеетТип("ФиксированнаяКоллекцияЗначений");
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура КлючиИЗначения() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"КлючиИЗначения"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).ИмеетТип("ФиксированноеМножествоКлючейИЗначений");
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Количество() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Количество"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).Равно(3);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Очистить() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Очистить"
	);

	// Тогда

	Ожидаем.Что(КартаСоответствие).ИмеетДлину(0);

КонецПроцедуры

&Тест
Процедура Вставить() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Вставить",
		"3",
		3
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат.Получить()).Равно(3);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ВставитьВсе() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	ВставляемаяКарта = Новый КартаСоответствие();

	ВставляемаяКарта.Вставить("1", 1);
	ВставляемаяКарта.Вставить("2", 2);
	ВставляемаяКарта.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ВставитьВсе",
		ВставляемаяКарта
	);

	// Тогда

	Ожидаем.Что(КартаСоответствие).ИмеетДлину(3);
	Ожидаем.Что(КартаСоответствие.Получить("1").Получить()).Равно(1);
	Ожидаем.Что(КартаСоответствие.Получить("2").Получить()).Равно(2);
	Ожидаем.Что(КартаСоответствие.Получить("3").Получить()).Равно(3);

КонецПроцедуры

&Тест
Процедура ВставитьЕслиОтсутствует() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ВставитьЕслиОтсутствует",
		"4",
		4
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	КоличествоПустых   = 0;
	КоличествоНеПустых = 0;

	Для каждого Результат Из Результаты Цикл

		Если Результат.Пустой() Тогда
			КоличествоПустых = КоличествоПустых + 1;
		Иначе
			КоличествоНеПустых = КоличествоНеПустых + 1;
		КонецЕсли;

	КонецЦикла;

	Ожидаем.Что(КоличествоПустых).Равно(1);
	Ожидаем.Что(КоличествоНеПустых).Равно(4);

	Ожидаем.Что(ПроверяемаяКарта.Получить("4").Получить()).Равно(4);

КонецПроцедуры

&Тест
Процедура ВычислитьБезусловно() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ВычислитьБезусловно",
		"4",
		Новый Действие(ЭтотОбъект, "ФункцияПереназначения")
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат.Получить()).Равно(4);
	КонецЦикла;

	Ожидаем.Что(ПроверяемаяКарта.Получить("4").Получить()).Равно(4);

КонецПроцедуры

&Тест
Процедура ВычислитьЕслиОтсутствует() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ВычислитьЕслиОтсутствует",
		"4",
		Новый Действие(ЭтотОбъект, "ФункцияНазначения")
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат.Получить()).Равно(4);
	КонецЦикла;

	Ожидаем.Что(ПроверяемаяКарта.Получить("4").Получить()).Равно(4);

КонецПроцедуры

&Тест
Процедура ВычислитьЕслиПрисутствует() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ВычислитьЕслиПрисутствует",
		"3",
		Новый Действие(ЭтотОбъект, "ФункцияНазначения")
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат.Получить()).Равно(3);
	КонецЦикла;

	Ожидаем.Что(ПроверяемаяКарта.Получить("3").Получить()).Равно(3);

КонецПроцедуры


&Тест
Процедура Слить() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Слить",
		"3",
		3,
		Новый Действие(ЭтотОбъект, "ФункцияПереназначения")
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат.Получить()).Равно(3);
	КонецЦикла;

	Ожидаем.Что(ПроверяемаяКарта.Получить("3").Получить()).Равно(3);

КонецПроцедуры

&Тест
Процедура Заменить() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Заменить",
		"3",
		3
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат.Получить()).Равно(3);
	КонецЦикла;

	Ожидаем.Что(ПроверяемаяКарта.Получить("3").Получить()).Равно(3);

КонецПроцедуры

&Тест
Процедура ЗаменитьЕслиЗначение() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ЗаменитьЕслиЗначение",
		"3",
		3,
		3
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат).ЭтоИстина();
	КонецЦикла;

	Ожидаем.Что(ПроверяемаяКарта.Получить("3").Получить()).Равно(3);

КонецПроцедуры

&Тест
Процедура ЗаменитьВсе() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 2);
	КартаСоответствие.Вставить("2", 3);
	КартаСоответствие.Вставить("3", 4);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"ЗаменитьВсе",
		Новый Действие(ЭтотОбъект, "ФункцияПереназначения")
	);

	// Тогда

	Ожидаем.Что(ПроверяемаяКарта.Получить("1").Получить()).Равно(1);
	Ожидаем.Что(ПроверяемаяКарта.Получить("2").Получить()).Равно(2);
	Ожидаем.Что(ПроверяемаяКарта.Получить("3").Получить()).Равно(3);

КонецПроцедуры

&Тест
Процедура Удалить() Экспорт

	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);

	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ПроверяемаяКарта,
		"Удалить",
		"3"
	);

	// Тогда

	Ожидаем.Что(Результаты).ИмеетТип("Массив").ИмеетДлину(5);

	КоличествоПустых   = 0;
	КоличествоНеПустых = 0;

	Для каждого Результат Из Результаты Цикл

		Если Результат.Пустой() Тогда
			КоличествоПустых = КоличествоПустых + 1;
		Иначе
			КоличествоНеПустых = КоличествоНеПустых + 1;
		КонецЕсли;

	КонецЦикла;

	Ожидаем.Что(КоличествоПустых).Равно(4);
	Ожидаем.Что(КоличествоНеПустых).Равно(1);

	Ожидаем.Что(ПроверяемаяКарта.Получить("3").Пустой()).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ПреставлениеПереопределяется() Экспорт
	
	// Дано

	КартаСоответствие = Новый КартаСоответствие();

	КартаСоответствие.Вставить("1", 1);
	КартаСоответствие.Вставить("2", 2);
	КартаСоответствие.Вставить("3", 3);

	ПроверяемаяКарта = Новый СинхронизированнаяКарта(КартаСоответствие);
	
	// Когда

	Результаты = ВыполнитьВПятьПотоков(
		ТестМодуль,
		"ВСтроку",
		ПроверяемаяКарта
	);

	// Тогда
	
	Для каждого Результат Из Результаты Цикл
		Ожидаем.Что(Результат)
			.Равно("{1=1, 2=2, 3=3}");
	КонецЦикла;

КонецПроцедуры

Функция ФункцияПереназначения(Ключ, Значение) Экспорт
	Возврат Число(Ключ);
КонецФункции

Функция ФункцияНазначения(Ключ, Значение) Экспорт
	Возврат Число(Ключ);
КонецФункции

Процедура ДобавитьКПроверяемомуЧислу(Ключ, Значение) Экспорт
	ПроверяемоеЧисло = ПроверяемоеЧисло + Ключ + Значение;
КонецПроцедуры

Функция ВыполнитьВПятьПотоков(
	Сценарий,
	ИмяМетода,
	Параметр = Неопределено,
	ВторойПараметр = Неопределено,
	ТретийПараметр = Неопределено)
	
	Параметры = Новый Массив;

	Если Не Параметр = Неопределено Тогда
		Параметры.Добавить(Параметр);
	КонецЕсли;

	Если Не ВторойПараметр = Неопределено Тогда
		Параметры.Добавить(ВторойПараметр);
	КонецЕсли;

	Если Не ТретийПараметр = Неопределено Тогда
		Параметры.Добавить(ТретийПараметр);
	КонецЕсли;

	Задания = Новый Массив();

	Для Счетчик = 1 По 5 Цикл // BSLLS:UnusedLocalVariable-off

		Задания.Добавить(
			ФоновыеЗадания.Выполнить(Сценарий, ИмяМетода, Параметры)
		);

	КонецЦикла;

	Попытка
		ФоновыеЗадания.ОжидатьЗавершенияЗадач();
	Исключение

		ВызватьИсключение ПодробноеПредставлениеОшибки( 
			ИнформацияОбОшибке().Параметры[0].ИнформацияОбОшибке
		);

	КонецПопытки;

	Результаты = Новый Массив;

	Для каждого ФоновоеЗадание Из Задания Цикл
		Результаты.Добавить(ФоновоеЗадание.Результат);
	КонецЦикла;

	ФоновыеЗадания.Очистить();

	Возврат Результаты;

КонецФункции
