#Использовать ".."

&Тест
Процедура КакКарта() Экспорт
	
	// Дано

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("1", 1);
	Соответствие.Вставить("2", 2);
	Соответствие.Вставить("3", 3);

	// Когда

	Результат = Соответствия.КакКарта(Соответствие);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("КартаСоответствие")
		.ИмеетДлину(3);

	Ожидаем.Что(Результат.Получить("1").Иначе_(0)).Равно(1);
	Ожидаем.Что(Результат.Получить("2").Иначе_(0)).Равно(2);
	Ожидаем.Что(Результат.Получить("3").Иначе_(0)).Равно(3);

КонецПроцедуры

&Тест
Процедура ИзЭлементов() Экспорт
	
	// Когда

	Результат = Соответствия.ИзЭлементов(
		"1", 1, "2", 2, "3", 3, "4", 4, "5", 5
	);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("ФиксированноеСоответствие")
		.ИмеетДлину(5);

	Для Сч = 1 По 5 Цикл
		Ожидаем.Что(Результат.Получить(Строка(Сч))).Равно(Сч);
	КонецЦикла;

КонецПроцедуры

&Тест
Процедура Скопировать() Экспорт

	// Дано

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("1", 1);
	Соответствие.Вставить("2", 2);
	Соответствие.Вставить("3", 3);

	// Когда

	Результат = Соответствия.Скопировать(Соответствие);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("Соответствие")
		.ИмеетДлину(3)
		.Не_().Равно(Соответствие);

	Ожидаем.Что(Результат.Получить("1")).Равно(1);
	Ожидаем.Что(Результат.Получить("2")).Равно(2);
	Ожидаем.Что(Результат.Получить("3")).Равно(3);

КонецПроцедуры

&Тест
Процедура СкопироватьФиксированное() Экспорт

	// Дано

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("1", 1);
	Соответствие.Вставить("2", 2);
	Соответствие.Вставить("3", 3);

	Соответствие = Новый ФиксированноеСоответствие(Соответствие);

	// Когда

	Результат = Соответствия.Скопировать(Соответствие);

	// Тогда

	Ожидаем.Что(Результат)
		.ИмеетТип("Соответствие")
		.ИмеетДлину(3)
		.Не_().Равно(Соответствие);

	Ожидаем.Что(Результат.Получить("1")).Равно(1);
	Ожидаем.Что(Результат.Получить("2")).Равно(2);
	Ожидаем.Что(Результат.Получить("3")).Равно(3);

КонецПроцедуры
