Перем ВнутреннийИтератор; // Реальный итератор

Функция Следующий() // BSLLS:UnusedLocalMethod-off
	Возврат ВнутреннийИтератор.ЕстьСледующий();
КонецФункции

Функция ТекущийЭлемент() // BSLLS:UnusedLocalMethod-off
    Возврат ВнутреннийИтератор.Следующий();
КонецФункции

// Адаптер итератора коллекции под протокол обхода движка OneScript
//
// Позволяет обходить коллекции фреймворка конструкцией `Для Каждого ... Из ... Цикл`.
// Экземпляры класса создаются коллекциями самостоятельно, в прикладном коде
//  использовать этот класс не требуется
//
// Конструктор объекта
//
// Параметры:
//   Итератор - ЧитающийИтератор - Итератор коллекции, который требуется адаптировать
//
&Итератор
Процедура ПриСозданииОбъекта(Итератор)
	ВнутреннийИтератор = Итератор;
КонецПроцедуры
